import { Box, Text } from 'ink';
import { ReactNode } from 'react';

type Props = {
  readonly subContent?: ReactNode;
};

export function Header({ subContent }: Props) {
  const logo = `
██╗      ██████╗  ██████╗ █████╗ ██╗     ███████╗██████╗  ██████╗ ███████╗
██║     ██╔═══██╗██╔════╝██╔══██╗██║     ██╔════╝██╔══██╗██╔════╝ ██╔════╝
██║     ██║   ██║██║     ███████║██║     █████╗  ██║  ██║██║  ███╗█████╗
██║     ██║   ██║██║     ██╔══██║██║     ██╔══╝  ██║  ██║██║   ██║██╔══╝
███████╗╚██████╔╝╚██████╗██║  ██║███████╗███████╗██████╔╝╚██████╔╝███████╗
╚══════╝ ╚═════╝  ╚═════╝╚═╝  ╚═╝╚══════╝╚══════╝╚═════╝  ╚═════╝ ╚══════╝
`;

  return (
    <Box flexDirection="column">
      <Text color="cyan">{logo}</Text>
      {subContent ? subContent : <Text bold color="gray">local domain manager</Text>}
    </Box>
  );
}
